{"modelTopology": {"training_config": {"metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false, "decay": 0.0, "beta_1": 0.8999999761581421}}, "sample_weight_mode": null, "loss_weights": null, "loss": "categorical_crossentropy"}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_2", "batch_input_shape": [null, 50, 98]}}, {"class_name": "LSTM", "config": {"go_backwards": false, "use_bias": true, "trainable": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_constraint": null, "activation": "tanh", "activity_regularizer": null, "units": 40, "name": "lstm_3", "implementation": 1, "unroll": false, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "kernel_regularizer": null, "recurrent_dropout": 0.6, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "units": 40, "name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.1.6"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_3/kernel", "shape": [40, 40]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [40]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "lstm_3/kernel", "shape": [98, 160]}, {"dtype": "float32", "name": "lstm_3/recurrent_kernel", "shape": [40, 160]}, {"dtype": "float32", "name": "lstm_3/bias", "shape": [160]}]}]}